In [1]:
import pandas as pd
dataset = pd.read_csv('Employee_Salary_Dataset.csv')

In [2]:
dataset.head()

   ID  Experience_Years  Age  Gender  Salary
0   1                 5   28  Female  250000
1   2                 1   21    Male   50000
2   3                 3   23  Female  170000
3   4                 2   22    Male   25000
4   5                 1   17    Male   10000

In [3]:
dataset.tail()

    ID  Experience_Years  Age  Gender   Salary
30  31                10   34    Male    80000
31  32                15   54    Male   900000
32  33                20   55  Female  1540000
33  34                19   53  Female  9300000
34  35                16   49    Male  7600000

In [4]:
print('rows:', dataset.shape[0])
print('columns:', dataset.shape[1])

rows: 35
columns: 5

In [5]:
dataset.isnull().sum()

ID                  0
Experience_Years    0
Age                 0
Gender              0
Salary              0
dtype: int64

In [6]:
dataset_filled = dataset.copy()
for col in dataset_filled.columns:
    if dataset_filled[col].dtype in ['int64','float64']:
        dataset_filled[col] = dataset_filled[col].fillna(dataset_filled[col].mean())
    else:
        dataset_filled[col] = dataset_filled[col].fillna(dataset_filled[col].mode()[0])
dataset_filled.head()

   ID  Experience_Years  Age  Gender  Salary
0   1                 5   28  Female  250000
1   2                 1   21    Male   50000
2   3                 3   23  Female  170000
3   4                 2   22    Male   25000
4   5                 1   17    Male   10000